app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-02-09 22:14:25.263809"], ["updated_at", "2019-02-09 22:14:25.263809"]]
---
  def create

    # @student = Student.create(frist_name: params[:student][:first_name], last_name: params[:student][:last_name])
    @student = Student.create(params[:student])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-02-09 22:14:25.705293"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params[:student])